-- --------------------------------------------------------
-- Хост:                         127.0.0.1
-- Версия сервера:               8.0.30 - MySQL Community Server - GPL
-- Операционная система:         Win64
-- HeidiSQL Версия:              12.1.0.6537
-- --------------------------------------------------------

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET NAMES utf8 */;
/*!50503 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

-- Дамп данных таблицы itbank.client: ~4 rows (приблизительно)
INSERT INTO `client` (`idclient`, `urlreferal`, `fio`, `telef`, `email`, `sferawork`, `comment`, `firma`) VALUES
	(1, 'ООО "Инстаг"', 'Анишкова Анастасия Сергеевна', '34567894567', 'hdhdhjds@gmail', 'IT', 'Очень хочет', 'ООО "ДаотГао"'),
	(2, 'Правительство ЕАО', 'Екимова Яна Сергеевна', '45678567567', 'hwjjsjs@gmail', 'волонтерство', 'Активист ЕАО', 'Чистые сердца'),
	(3, 'Сеть "Интернет"', 'Голубева Евгения Анатольевна', '36737738783', 'wrwrtweip@gmail.com', 'веб-дизайн', 'есть план по реализации сайта', 'ООО "ЕВГШШС"'),
	(4, 'ООО"ВААВАП"', 'Матвеева Алёна Сергеевна', '377738444', 'hdhdhdhdhhdwouu39939@gmail.com', 'разработчик', 'кк', 'реклама');

-- Дамп данных таблицы itbank.manager: ~4 rows (приблизительно)
INSERT INTO `manager` (`idmanager`, `fio`, `telef`, `email`, `goodswork`) VALUES
	(1, 'Иванов Ивван Иванович', '463467348438438', 'annajsj@gmail.com', 80),
	(2, 'Лазовская Стефания Степановна', 'у6637378389', 'a1nnajsj@gmail.com', 23),
	(3, 'Маркова Владлена Леонидовна', '84848894', '786ajsj@gmail.com', 50),
	(4, 'Антонов Алексей Степанович', '47474774747', '74747448@gmail.com', 56);

-- Дамп данных таблицы itbank.statement: ~3 rows (приблизительно)
INSERT INTO `statement` (`idstatement`, `dates`, `idclent`, `namework`, `daterin`, `daterout`, `desc`, `summa`, `srokkredita`, `pervonzvon`, `countteam`, `idmanager`, `resoluciy`, `statuswork`, `dateof`) VALUES
	(1, '2023-09-22', 2, 'Polycam', '2023-09-22', '2023-09-22', 'Это технология на базе искусственного интеллекта, которая позволяет пользователям захватывать и делиться своим миром в 3D, используя видео LiDAR и данные о движении, доступные на смартфонах. С помощью приложения Polycam пользователи могут превращать обычные фотографии в детализированные, реалистичные творения, что делает его инновационным инструментом для профессионалов в области архитектуры, дизайна интерьера и моды. Приложение также подходит для повседневного использования и поддерживается известными венчурными компаниями, такими как Sequoia Capital и Chad Hurley. Polycam доступен для iOS, Android и веб, может использоваться в различных профессиональных 3D-процессах, включая планы этажей, архитектурные визуализации, визуальные эффекты и кинопроизводство.', 677890, 13, 5000000, '5', 2, 'в процессе', '3', '2023-09-22'),
	(2, '2023-09-22', 3, 'Photon Commerce', '2023-09-22', '2023-09-22', 'Фотонная коммерция— это финансовая платформа искусственного интеллекта, которая позволяет финтех-компаниям обрабатывать платежи B2B, счета, выписки, контракты и другие документы со сверхчеловеческой скоростью и с высокой точностью. Более 120 компаний в области финансовых технологий, электронной коммерции и логистики используют эту технологию, чтобы лучше понимать своих клиентов и взаимодействовать с ними, а Photon обработал более 23 миллиардов долларов данных о платежах и счетах-фактурах со своими клиентами и партнерами. Технология искусственного интеллекта Photon позволяет компаниям собирать, настраивать и использовать сложные данные, чтобы понимать своих клиентов на более глубоком уровне, чем когда-либо прежде.', 890484, 10, 600000, '4', 4, 'заключительный этап', '3', '2023-09-22'),
	(3, '2023-09-22', 1, 'CloudAEye', '2023-09-22', '2023-09-22', 'ОблакоAEye — это отличное решение искусственного интеллекта для микросервисов. Они создали сложную технологию на основе искусственного интеллекта, которая обеспечивает сквозную видимость бессерверных приложений. Команда из Сан-Франциско осознала важность времени выхода на рынок и надежности обслуживания в современном удаленном мире, особенно с учетом того, что, по данным IDC, 29,3% предприятий сталкиваются с простоями, стоимость которых превышает 25 тысяч долларов в час. Технология CloudAEye включает в себя модели на основе ИИ, которые используют интеллектуальный мониторинг для анализа данных приложений, выявления аномалий и предоставления подробного анализа первопричин каждого инцидента, что позволяет клиентам быстро понять и устранить проблемы.', 3324440, 12, 99000, '2', 3, 'начало', '3', '2023-09-22');

-- Дамп данных таблицы itbank.vidi: ~4 rows (приблизительно)
INSERT INTO `vidi` (`idvidi`, `name`, `desc`, `detail`) VALUES
	(1, 'Государственная ITподдержка', 'это программа субсидирования процентных ставок по кредитам на покупку жилья: государство помогает отдельным категориям граждан приобрести собственную недвижимость в ипотеку по сниженной процентной ставке', 'Первоначальный взнос от 15%\r\nСрок кредита до 30 лет\r\nСумма кредита до 6 млн ₽\r\nИпотека с господдержкой от 7,3%'),
	(2, 'IT Student kredit', 'Участники этой программы могут взять ипотеку или рефинансировать уже имеющийся кредит по льготной ставке — 6%. Разницу между обычной и льготной ставкой банку компенсирует государство.', 'Первоначальный взнос от 15%\r\nСрок кредита до 30 лет\r\nСумма кредита до 6 млн ₽\r\nИпотека с господдержкой от 7,3%'),
	(3, 'Социальный It кредит', 'Участники этой программы могут взять ипотеку или рефинансировать уже имеющийся кредит по льготной ставке — 6%. Разницу между обычной и льготной ставкой банку компенсирует государство.', 'Первоначальный взнос от 15%\r\nСрок кредита до 30 лет\r\nСумма кредита до 6 млн ₽\r\nИпотека с господдержкой от 7,3%'),
	(4, 'Бизнес для молодых IT специалистов', 'это льготная программа, принятая после постановления Правительства России в марте 2022 года о поддержке сотрудников компаний, осуществляющих деятельность в сфере информационных технологий. Господдержка позволяет получить ипотечный кредит с пониженной процентной ставкой до 5% годовых на жилой дом или квартиру от застройщика в готовой или строящейся новостройке.', 'Первоначальный взнос от 15%\r\nСрок кредита до 30 лет\r\nСумма кредита до 6 млн ₽\r\nИпотека с господдержкой от 7,3%');

/*!40103 SET TIME_ZONE=IFNULL(@OLD_TIME_ZONE, 'system') */;
/*!40101 SET SQL_MODE=IFNULL(@OLD_SQL_MODE, '') */;
/*!40014 SET FOREIGN_KEY_CHECKS=IFNULL(@OLD_FOREIGN_KEY_CHECKS, 1) */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40111 SET SQL_NOTES=IFNULL(@OLD_SQL_NOTES, 1) */;
