<?php

use yii\db\Migration;

/**
 * Class m231218_070712_insert_data_into_test_table
 */
class m231218_070712_insert_data_into_test_table extends Migration
{
    /**
     * {@inheritdoc}
     */
    public function safeUp()
    {
        $this->batchInsert(
            'works',
            [
                'id_student',
                'id_sotrudnik',
                'id_specialty',
                'id_podpis',
                'datez',
                'name',
                'status',
                'typew',
                'ozenka',
                'mycheckwork',
                'docmycheckwork',
                'intercheckwork',
                'docintercheckwork',
                'publicwork',
                'filework',
                'statuswork',
            ],
            [
                [1, 'Козлов В.А.', 'Окружающий мир', 'Валерия', '13.02.2018', 'Узбекская кухня', 'Зачтено', 'Диплом', 5, 80, null, null, null, 5, 'Файл1', 'Статус1'],
                [2, 'Валерьев. И.А.', 'Обществознание', 'Игорь', '08.05.2020', 'В обществе', 'Зачтено', 'Курсовая', '4', 85, null, null, null, 65, 'Файл2', 'Статус2'],
                [3, 'Иванов В.А.', 'Физкультура', 'Владислав', '06.02.2021', 'Физическая нагрузка', 'Зачтено', 'Статья', 5, 80, null, null, null, 5, 'Файл1', 'Статус1'],
                [4, 'Кузнецов А.Е.', 'Русский язык', 'Анна', '03.10.2021', 'Правила русского языка', 'Зачтено', 'Статья', 5, 80, null, null, null, 5, 'Файл1', 'Статус1'],
                [5, 'Малик А.', 'Source', 'Вадим', '07.12.2021', 'Создание сервера', 'Зачтено', 'Статья', 5, 80, null, null, null, 5, 'Файл1', 'Статус1'],
                [6, 'Акентьев Д.', 'Математика', 'Валентин', '01.02.2022', 'Интеграллы', 'Зачтено', 'Статья', 5, 80, null, null, null, 5, 'Файл1', 'Статус1'],
                [7, 'Гринь Р.', 'Программирование PHP', 'Яна', '09.03.2022', 'Создание поиска', 'Зачтено', 'Диплом', 5, 80, null, null, null, 5, 'Файл1', 'Статус1'],
                [8, 'Якубович А.', 'Технология', 'Дмитрий', '01.04.2022', 'Срубка леса', 'Незачтено', 'Диплом', 5, 80, null, null, null, 5, 'Файл1', 'Статус1'],
                [9, 'Щербаков. А.', 'Биология', 'Валентин', '04.05.2022', 'Организм человека', 'Зачтено', 'Диплом', 5, 80, null, null, null, 5, 'Файл1', 'Статус1'],
                [10, 'Крюковских М.', 'Юристпроденция', 'Макс', '25.06.2022', 'Права человека', 'Зачтено', 'Диплом', 5, 80, null, null, null, 5, 'Файл1', 'Статус1'],
                [11, 'Мирошников А.', 'Юристпроденция', 'Макс', '25.06.2022', 'Обязанности человека', 'Зачтено', 'Статья', 5, 80, null, null, null, 5, 'Файл1', 'Статус1'],
                [12, 'Оборванец И.', 'CS', 'Вадим', '05.08.2022', 'Обучение префам', 'Зачтено', 'Статья', 5, 80, null, null, null, 5, 'Файл1', 'Статус1'],
                [13, 'Голодный Я.', 'DOTA2', 'Максим', '15.09.2022', 'Изучение героев', 'Зачтено', 'Диплом', 5, 80, null, null, null, 5, 'Файл1', 'Статус1'],
                [14, 'Сытый Л.', 'RUST', 'Данил', '29.09.2022', 'Строительство', 'Незачет', 'Диплом', 5, 80, null, null, null, 5, 'Файл1', 'Статус1'],
                [15, 'Пьянный Л.', 'Что то там', 'Кто то', '11.11.2022', 'О чем то', 'Незачет', 'Диплом', 5, 80, null, null, null, 5, 'Файл1', 'Статус1'],
            ]
        );
    }

    /**
     * {@inheritdoc}
     */
    public function safeDown()
    {
        $this->delete('works', ['id_works' => [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15]]);
    }

    /*
    // Use up()/down() to run migration code without a transaction.
    public function up()
    {

    }

    public function down()
    {
        echo "m231218_070712_insert_data_into_test_table cannot be reverted.\n";

        return false;
    }
    */
}
