<?php

use yii\db\Migration;

/**
 * Handles the creation of table `{{%category}}`.
 */
class m231221_131613_create_category_table extends Migration
{
    /**
     * {@inheritdoc}
     */
    public function safeUp()
    {
        $this->batchInsert(
            'tovar',
            [
                'id_works',
                'id_sotrudnik',
                'id_specialty',
                'id_podpis',
                'datez',
                'food',
            ],
            [
                [1,  'Изосимов В.'   , 'Повар'              , 'Василий'         , '14.03.2021', 'Гамбургер' ],
                [2,  'Дмитриев. К.'  , 'Повар-кондитер'     , 'Кит'             , '02.04.2022', 'Торт'],
                [3,  'Иванов У.'     , 'Шеф-повар'          , 'Уильям'          , '21.01.2020', 'Салат с крабом'],
                [4,  'Колеков А.'    , 'Бухгалтер'          , 'Анна'            , '08.06.2021', 'Бутерброд'],
                [5,  'Малик П.'      , 'Повар-кондитер'     , 'Пруся'           , '02.07.2021', 'Пирожки с повидлом'],
                [6,  'Акентьев Д.'   , 'Менеджер'           , 'Даниил'          , '11.06.2019', 'Бутерброд'],
                [7,  'Гринь Е.'      , 'Повар-кондитер'     , 'Емильян'         , '07.01.2022', 'Торт'],
                [8,  'Вячеславов С.' , 'Моллекулярный повар', 'Святослав'       , '11.11.2020', 'Икра'],
                [9,  'Щербаков. А.'  , 'Су-шеф'             , 'Алексей'         , '24.12.2021', 'Суп'],
                [10, 'Марковский Р.' , 'Повар'              , 'Ростислав'       , '16.09.2022', 'Мясные котлеты'],

            ]
        );
    }
    /**
     * {@inheritdoc}
     */
    public function safeDown()
    {
        $this->delete('tovar', ['id_works' => [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]]);
    }
    
}
