<?php

/** @var yii\web\View $this */

use yii\helpers\Html;

$this->title = 'О нас';
$this->params['breadcrumbs'][] = $this->title;
?>
<div class="site-about">
<p> О «Call-центр» </p>
 <br>
	<br>
	<br>
	<br>
	<br>
	<br>
	<br>
  
	<li class="kitt-list-item kitt-list-item_ul"> Стали партнёрами более 1000 клиентов из различных сфер бизнеса: операторы связи, интернет провайдеры, интернет-магазины, крупнейшие розничные сети по продаже продуктов питания и фэшн индустрии, финансы и аудит, строительство, производство, торговля, грузо- и пассажироперевозки и т.д..<li>
    Стали партнёрами более 1000 клиентов из различных сфер бизнеса: операторы связи, интернет провайдеры, интернет-магазины, крупнейшие розничные сети по продаже продуктов питания и фэшн индустрии, финансы и аудит, строительство, производство, торговля, грузо- и пассажироперевозки и т.д..</li>
	<li>«Контакт Сервис» имеет сертификат соответствия ISO 18295-1:2017 (Customer contact centres), сертификат менеджмента информационной безопасности ISO/IEC 27001:2013, сертификат системы менеджмента качества ISO 9001-2015 Пятиступенчатая система контроля качества позволяет оказывать услуги на высочайшем уровне. За проектом закрепляется индивидуальный менеджер, ведётся проверка работы каждого оператора, оперативно корректируется сценарий, предоставляются детализированные отчёты по всем звонкам.</li>
    <li class="kitt-list-item kitt-list-item_ul">Мы работаем более 10 лет.</li>
</ul>
<div class="kitt-grid kitt-grid_fixed  ">
<div class="kitt-row page-teaser-dictrow">
<div class="kitt-col kitt-col_xs_12  kitt-col_md_6 kitt-col_lg_5 kitt-col_xl_6">
		</div><img alt="Горячие туры" src="/web/image/center2.jpg">

   <div id=rezultat>
   
   </div>
  
</div>